itemsAPI/app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
      if params[:search]
      @items = Item.where(:id => params[:search])
      else
          @items = Item.all

INSERT INTO "items" ("price", "description", "stockQty", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["price", 10.0], ["description", "a test description"], ["stockQty", 12], ["created_at", "2019-08-12 04:09:02.924113"], ["updated_at", "2019-08-12 04:09:02.924113"]]
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "stockQty" = ?, "description" = ?, "price" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["stockQty", 5], ["description", "Andis T-Outliner"], ["price", 39.99], ["updated_at", "2019-08-13 07:55:29.874933"], ["id", 2]]
---
  def update
    @id = params['id'].to_i
    @stockQty = params['stockQty'].to_i
    @description = params['description']
    @price = params['price'].to_f
    respond_to do |format|
      Item.find(@id).update(stockQty:@stockQty, description: @description, price: @price )